In [21]:
import pandas as pd

# Step 1: Create a DataFrame
data = {
    'Name': ['John', 'Alice', 'Bob', 'Diana'],
    'Age': [28, 34, 23, 29],
    'Department': ['HR', 'IT', 'Marketing', 'Finance'],
    'Salary': [45000, 60000, 35000, 50000]
}

In [22]:
df=pd.DataFrame(data)
df

    Name  Age Department  Salary
0   John   28         HR   45000
1  Alice   34         IT   60000
2    Bob   23  Marketing   35000
3  Diana   29    Finance   50000

In [26]:
#to display first two rows
df.head(2)

    Name  Age Department  Salary   Bonus
0   John   28         HR   45000  4500.0
1  Alice   34         IT   60000  6000.0

In [29]:

df['Bonus']=df['Salary'] * 0.20
df

    Name  Age Department  Salary    Bonus
0   John   28         HR   45000   9000.0
1  Alice   34         IT   60000  12000.0
2    Bob   23  Marketing   35000   7000.0
3  Diana   29    Finance   50000  10000.0

In [31]:
#calculate the average salary
average_Salary=df['Salary'].mean()
average_Salary

np.float64(47500.0)

In [34]:
print(average_Salary)

47500.0

In [35]:
#Filter and display employees who are older than 25
older_than_25 = df[df['Age'] > 25]
older_than_25

    Name  Age Department  Salary    Bonus
0   John   28         HR   45000   9000.0
1  Alice   34         IT   60000  12000.0
3  Diana   29    Finance   50000  10000.0

In [36]:
print(older_than_25)

    Name  Age Department  Salary    Bonus
0   John   28         HR   45000   9000.0
1  Alice   34         IT   60000  12000.0
3  Diana   29    Finance   50000  10000.0